{
  "projects": [
    {
      "title": "TeraBox game",
      "description": "Game made in the subject Software de Entretenimiento y Videojuegos (Software of Entertainment and Videogames)",
      "img": "media/project_cards/terabox_title.png",
      "link": null,
      "downloadLink": "download/TeraBox.zip",
      "moreDetailsInfo": null
    },
    {
      "title": "Rock Shop Web",
      "description": "Website E-Commerce made with MERN stack. Developed with a team of 4 including me during the subject of Arquitectura de Software (Software Architecture)",
      "img": "media/project_cards/rockshop_logo.png",
      "link": null,
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "Labyrinth Game",
      "description": "Mini game made on Canvas element with javascript. Developed during the subject of Software y Est치ndares para la Web (Web Software and Standards)",
      "img": "media/project_cards/labyrinth_game.png",
      "link": "https://valydumitru01.github.io/SEW/P-JS/Ej-14/Ejercicio14.html",
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "Weather Tool",
      "description": "Weather tool which allows the user to click on a point in the map to see how is the exact weather in that position. Developed during the subject of Software y Est치ndares para la Web (Web Software and Standards)",
      "img": "media/project_cards/weather_picker.png",
      "link": "https://valydumitru01.github.io/SEW/P-JS/Ej-11/Tarea-6/Ejercicio11_Tarea6.html",
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "Maple Lenguage",
      "description": "Lexical analysis, syntactic analysis, memory management and code generation of MAPL code. Project developed during the subject Dise침o de Lenguajes de Programaci칩n (Programming Languages Design)",
      "img": "media/project_cards/maple_lenguage.jpg",
      "link": null,
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "My Portfolio",
      "description": "Website made with HTML, Javascript, Bootstrap and JQuery. Developed by myself during a summer to show my work.",
      "img": "media/project_cards/my_portfolio.png",
      "link": "https://valydumitru01.github.io/ValentinDumitrusPortfolio/",
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "Final Degree Project",
      "description": "3D Game Engine with ECS Architecture: The project is a custom, simple, game engine written in C++ with SDL and OpenGL. It included a ECS architecture over some subsystems, mainly a graphic engine, a physics engine, an input engine and a custom console. One of the hardest tasks was fully developing and testing a custom header only math library for it. Another hard task was developing and testing an interface to decouple OpenGL from the graphic engine, to allow a possible API swap in the future.",
      "img": "media/project_cards/opengl_triangle.gif",
      "link": null,
      "githubLink": null,
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "Blender Projects",
      "description": "3D renders made with blender for artistic purposes. Developed during my free time, and it started before I began going to university.",
      "img": "media/aboutme/blender/room.png",
      "link": null,
      "downloadLink": null,
      "moreDetailsInfo": null
    },
    {
      "title": "And More...",
      "description": "Many other small projects were done during my career. Some as hard as the other ones, but not as attractive and visual. Here I explain the most important not so important projects.",
      "img": "media/project_cards/random_picture_for_more.jpg",
      "link": null,
      "downloadLink": null,
      "moreDetailsInfo": null
    }
  ]
}